# 제출자 : 이소정
# 작성일 : 2019-11-28
# 제출일 : 2019-11-28
#
# 문1)
d1 <- 1:50
d2 <- 51:100
# 1.1
d1
d2
# 1.2
length(d2)
# 1.3
d1 + d2
d2 - d1
d1 * d2
d2 / d1
# 1.4
sum(d1)
sum(d2)
# 1.5 수정
sum(c(d1,d2)) # 방법 1
sum(d1)+sum(d2) # 방법 2
# 1.6
max(d2)
min(d2)
# 1.7 수정
mean(d2)
mean(d1)
mean(d2)-mean(d1)
#더 요약
abs(mean(d2)-mean(d1))
# 1.8
sort(d1, decreasing = TRUE)
# 1.9 수정
sort(d1,decreasing = FALSE)
sort(d2,decreasing = FALSE)
d3 <- c(head(d1,10),head(d2,10)) 
d3
#더 간략
d3 <- c( sort( d1 )[ 1:10 ], sort( d2 )[ 1:10 ] )
d3 

#
# 문2
v1 <- 51:90
# 2.1
v1[v1<60]
# 2.2
v1_2 <- v1[v1<70]; v1_2
length(v1_2)
# 2.3
v1_3 <- v1[v1>65]; v1_3
sum(v1_3)
# 2.4
v1_4 <- v1[v1>60&v1<73]
v1_4
# 2.5
v1_5 <- v1[v1<65|v1>80]
v1_5
# 2.6
v1_6 <- v1 %% 7
v1[v1_6 == 3]
# 2.7
v1[v1 %% 7 == 0] <- 0
v1
# 2.8
v1_8 <- v1[v1 %% 2 == 0]; v1_8
sum(v1_8)
# 2.9
v1[v1 %% 2 == 1|v1>80]
# 2.10 수정
v1[v1 %% 3 == 0 & v1 %% 5 ==0]
# 2.11 수정
v1_11 <- 2*v1[v1 %% 2 == 0]; v1_11
# 풀이법
v1[ v1 %% 2 == 0 ] <- v1[ v1 %% 2 == 0 ] * 2
v1
# 2.12
v1_12 <- v1[v1 %% 7 == 0]
setdiff(v1,v1_12)
# 다른 방법
v1 <- v1[v1 %% 7 != 0 ]
v1
